app/controllers/htmlcodes_controller.rb

SELECT `htmlcodes`.* FROM `htmlcodes` WHERE (name LIKE '%space%' OR description LIKE '%space%')
---
	def search
	  @htmlcodes = Htmlcode.search params[:query]